{
  "company_name": "PEOPLE'S LEASING & FINANCE PLC",
  "company_symbol": "PLC",
  "report_type": "Interim",
  "report_date": "01 April 2024",
  "currency_unit": "LKR",
  "scale_factor": 1.0,
  "financial_metrics": {
    "revenue": -5.2891014600013454e+35,
    "profit_for_period": -2.482385325292863e+33,
    "operating_profit": null,
    "total_assets": 1.5918636171553956e+39,
    "total_liabilities": null,
    "total_equity": 1.1068903221135466e+39,
    "basic_eps": null,
    "gross_profit": -2.299506425488345e+35,
    "ebitda": null,
    "net_cash_flow": null
  },
  "shareholders": [],
  "directors": [],
  "audit_status": "Audited",
  "errata_notice": null,
  "contingent_liabilities": "other than which were disclosed in the annual report for the year \nended 31st March 2025.\nCash and cash equivalents for the cash flow purposes\nFair value measurement and related fair value disclosures\nThe fair values of all the financial assets and financial liabilities recognized during the period were not materially different from the \ntransaction prices at the date of initial recognition. There were no transfers between Level 1 and Level 2 and no transfers into or \nout of Level 3 categories as per the fair value hierarchy, during the period. Further, carrying values of financial assets and financial \nliabilities as at the end of the reporting period were assumed that the respective carrying amounts approximate their fair values.\nThe Company's parent undertaking is Royal Ceramics Lanka PLC and ultimate parent undertaking is Vallibel One PLC.\nCash and cash equivalents for the cash flow purposes.\nCompany/Group\nAs at 30th June \n2025\nAs at 30th June \n2024\nFavourable cash and cash equivalent balances.\nCash and bank balances\nUnfavourable cash and cash equivalent balances.\nThe presentation and classification of the financial statements of the previous period have been amended, where relevant, for\nbetter presentation and to be comparable with those of the current period.\nNumber of fully paid ordinary shares as at 30th June 2025 is 6,000,000 (31st March 2025 - 6,000,000).\nThe principal activity of LC Plantation Projects Limited is holding of investments. The Company was incorporated on 5th March \n2021.\nThe financial statements of the Company and the Group have been prepared in accordance with Sri Lanka Accounting Standards \ncomprising of SLFRS and LKAS as issued by the Institute of Chartered Accountants of Sri Lanka. \nThe financial statements of the Company and the Group have been prepared on a historical cost basis, other than land and \nbuildings that have been measured at fair value.\nSignificant Accounting Policies\nThe same accounting policies as disclosed in the  annual report for the year ended 31st March 2025 have been followed in the  \npreparation of interim financial statements and are in compliance with LKAS 34 - Interim Financial Reporting. \nThe consolidated financial statements of the Group comprise of Lanka Ceramic PLC (Parent Company) and its fully owned \nsubsidiary; LC Plantation Projects Limited.\nFigures for the period ended 30th June 2025 are provisional and subject to audit.\nCorporate Information\nLanka Ceramic PLC (\"the Company\") is a public limited liability Company incorporated and domiciled in Sri Lanka and listed on\nthe Colombo Stock Exchange. The registered office of the Company is located at No.23, Narahenpita Road, Nawala.",
  "events_after_reporting": null,
  "extraction_confidence": 0.6666666666666666,
  "document_hash": null
}